In [1]:
import pandas as pd

In [12]:
df = pd.read_csv("D:/FIAP/Engenharia de Machine Learning/Fase 1/Projeto1/public/data/books.csv")

In [13]:
df.head(5)

,title,price,availability,rating,category,image_path
0,It's Only the Himalayas,Â£45.17,In stock,Two,Travel,public/images\27a53d0bb95bdd88288eaf66c9230d7e...
1,Full Moon over Noahâs Ark: An Odyssey to Mou...,Â£49.43,In stock,Four,Travel,public/images\57770cac1628f4407636635f4b85e88c...
2,See America: A Celebration of Our National Par...,Â£48.87,In stock,Three,Travel,public/images\9a7e63f12829df4b43b31d110bf3dc2e...
3,Vagabonding: An Uncommon Guide to the Art of L...,Â£36.94,In stock,Two,Travel,public/images\d5bf0090470b0b8ea46d9c166f7895aa...
4,Under the Tuscan Sun,Â£37.33,In stock,Three,Travel,public/images\98c2e95c5fd1a4e7cd5f2b63c52826cb...

In [5]:
df["id"] = df.index + 1
df.head()

,title,price,availability,rating,category,image_path,id
0,It's Only the Himalayas,Â£45.17,In stock,Two,Travel,tech_challenge/data/images\27a53d0bb95bdd88288...,1
1,Full Moon over Noahâs Ark: An Odyssey to Mou...,Â£49.43,In stock,Four,Travel,tech_challenge/data/images\57770cac1628f440763...,2
2,See America: A Celebration of Our National Par...,Â£48.87,In stock,Three,Travel,tech_challenge/data/images\9a7e63f12829df4b43b...,3
3,Vagabonding: An Uncommon Guide to the Art of L...,Â£36.94,In stock,Two,Travel,tech_challenge/data/images\d5bf0090470b0b8ea46...,4
4,Under the Tuscan Sun,Â£37.33,In stock,Three,Travel,tech_challenge/data/images\98c2e95c5fd1a4e7cd5...,5

In [14]:
df['image_path'][0]

https://pos-tech-machine-learning-engineer-eta.vercel.app/images/27a53d0bb95bdd88288eaf66c9230d7e.jpg'

'public/images\\27a53d0bb95bdd88288eaf66c9230d7e.jpg'